# Используем официальное окружение Node.js в качестве базового образа
FROM node:18

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы вашего приложения
COPY . .

# Собираем приложение
RUN npm run build

# Открываем порт, на котором будет работать приложение
EXPOSE 3000

# Определяем команду для запуска приложения
CMD ["npm", "run", "preview", "--", "--host", "0.0.0.0", "--port", "3000"]